Documents/СообщениеДилеру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>СообщениеДилеру</Name>
			<Comment>Документ для рассылки сообщений от супервайзера дилеру</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОзнакомленСообщенияДилеру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ОзнакомленСообщенияДилеру</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ознакомлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СообщениеДилеру</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дилер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/СообщениеДилеру/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбАвтор = Объект.Автор;
	
	Если ОбАвтор = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда	
		ОбАвтор=ПараметрыСеанса.ТекущийПользователь;
		Элементы.Ознакомленные.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)	
	УдалитьОзнакомленные();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура УдалитьОзнакомленные()
	
	Записи = РегистрыСведений.ОзнакомленСообщенияДилеру.СоздатьНаборЗаписей();
	Записи.Отбор.Сообщение.Установить(Объект.Ссылка);
	Записи.Прочитать();

	Для Каждого Зап Из Записи Цикл
	    Записи.Удалить(Зап);
	КонецЦикла;

	Записи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Ознакомленные(Команда)
	ПараметрыФормы = Новый Структура("Сообщение", Объект.Ссылка);
	ОткрытьФорму("Документ.СообщениеДилеру.Форма.ФормаОзнакомленные", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры
